#+TITLE: Emacs config
#+CREATED: <2023-02-23 Thu 23:59>
#+LAST_MODIFIED: [2023-06-19 Mon 23:57 EDT]
#+PROPERRY: header-args :tangle-mode `,#o444 :mkdirp yes
#+PROPERTY: header-args:emacs-lisp :tangle ../../../gen/emacs/init.el :tangle-mode `,#o444
#+OPTIONS: H:6

*** Benchmark
:PROPERTIES:
:CUSTOM_ID: benchmark
:END:

[[https://github.com/dholm/benchmark-init-el][benchmark-init]] is a simple package that may or may not carry its
weight versus ~usepackage-compute-statistics~.  Run
~benchmark-init/show-durations-tabulated~ to check this one out.

#+begin_src emacs-lisp
  (use-package benchmark-init
    :ensure t
    :demand t
    :hook (after-init . benchmark-init/deactivate)
    :config
    (benchmark-init/activate))
#+end_src

#+RESULTS:
| org-persist-load-all | benchmark-init/deactivate | tramp-register-archive-autoload-file-name-handler | magit-maybe-define-global-key-bindings | table--make-cell-map |

*** Garbage collection
:PROPERTIES:
:CUSTOM_ID: garbage-collection
:END:

Increasing the garbage collector threshold is reputed to help at init.
After startup, we revert on the [[https://gitlab.com/koral/gcmh][Garbage Collector Magic Hack]].

#+begin_src emacs-lisp
  (use-package gcmh
    :ensure t
    :diminish
    :init (setq gc-cons-threshold (* 80 1024 1024))
    :hook (emacs-startup . gcmh-mode))
#+end_src

#+RESULTS:
| gcmh-mode |

